uhnp/src/Enums/РежимыКонтроляДокументов/РежимыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыКонтроляДокументов</name>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
  <enumValues>
    <name>Информировать</name>
  </enumValues>
  <enumValues>
    <name>НеКонтролировать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/КлючиАналитикиПланированияСтатейБюджетов/КлючиАналитикиПланированияСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиПланированияСтатейБюджетов</name>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/ChartsOfCharacteristicTypes/ВидыКонтроляДокументов/ВидыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыКонтроляДокументов</name>
  <type>
    <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
    <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
    <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
    <types>CatalogRef.КлючиАналитикиПланированияРасчетовСКонтрагентами</types>
    <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
  </type>
  <predefined>
    <items>
      <name>КонтрольБюджетныхЛимитов</name>
      <description>Контроль бюджетных лимитов</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольБюджетныхРезервов</name>
      <description>Контроль бюджетных резервов</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольМаксимальнойСуммыЗадолженностиПоДоговору</name>
      <description>Контроль задолженности по договору</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбщейЗадолженностиКонтрагента</name>
      <description>Контроль задолженности по контрагенту</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбъемаЗакупок</name>
      <description>Контроль подтвержденного объема закупок</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
      </type>
    </items>
    <items>
      <name>КонтрольРасходовПоДоговору</name>
      <description>Контроль расходов по договору</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>РежимКонтроля</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/CommonModules/КонтрольУХПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ВсеПроверки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыКонтроляДокументов.Ссылка КАК ВидКонтроля
	|ИЗ
	|	ПланВидовХарактеристик.ВидыКонтроляДокументов КАК ВидыКонтроляДокументов
	|ГДЕ
	|	ВидыКонтроляДокументов.РежимКонтроля = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Блокировать)
	|	ИЛИ ВидыКонтроляДокументов.РежимКонтроля = ЗНАЧЕНИЕ(Перечисление.РежимыКонтроляДокументов.Информировать)
	|	ИЛИ ВидыКонтроляДокументов.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхЛимитов)
	|	ИЛИ ВидыКонтроляДокументов.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхРезервов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыКонтроляДокументов.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ПВХ = ПланыВидовХарактеристик.ВидыКонтроляДокументов;
	ОбщиеМодулиКонтроля = Новый Соответствие;
	ОбщиеМодулиКонтроля.Вставить(ПВХ.КонтрольБюджетныхЛимитов, КонтрольУХБюджетныеЛимиты);
	ИспользоватьРезервированиеФО = КонтрольЛимитовУХПовтИсп.ПолучитьЗначениеИспользованияРезервирования();
	Если ИспользоватьРезервированиеФО Тогда
		ОбщиеМодулиКонтроля.Вставить(ПВХ.КонтрольБюджетныхРезервов, КонтрольУХБюджетныеРезервы);
	КонецЕсли;
	ОбщиеМодулиКонтроля.Вставить(ПВХ.КонтрольОбщейЗадолженностиКонтрагента, КонтрольУХВзаиморасчетыПоКонтрагенту);
	ОбщиеМодулиКонтроля.Вставить(ПВХ.КонтрольМаксимальнойСуммыЗадолженностиПоДоговору, КонтрольУХВзаиморасчетыПоДоговору);
	ОбщиеМодулиКонтроля.Вставить(ПВХ.КонтрольРасходовПоДоговору, КонтрольУХРасходыПоДоговору);
	
	КонтрольУХВстраивание.ВсеПроверки(ОбщиеМодулиКонтроля);
	
	Результат = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщийМодуль = ОбщиеМодулиКонтроля[Выборка.ВидКонтроля];
		Если ОбщийМодуль <> неопределено Тогда
			Результат.Добавить(ОбщийМодуль);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазмещениеИсточниковКонтроля() Экспорт
	
	Результат = Новый Соответствие;
	
	КонтрольУХВстраивание.РазмещениеИсточниковКонтроля(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив зарегистрированных проверок для типа документа
//
// Параметры:
//  ИмяДокументаСсылка  - Строка - Имя из метаданных документа, для которого требуется получить список проверок
//
// Возвращаемое значение:
//   Массив   - массив структур с типом ПроверкаДокумента
//
Функция ЗарегистрированныеПроверки(ИмяДокумента = неопределено) Экспорт

	Результат = Новый Массив;
	Для Каждого Проверка Из КонтрольУХПовтИсп.ВсеПроверки() Цикл
		Если Проверка.ТребуетсяДляДокумента(ИмяДокумента) Тогда
			Результат.Добавить(Проверка.Создать());
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции // ЗарегистрированныеПроверки()

// Возвращает ОбъектПроверка по ПВХ.ВидыКонтроляДокументов
Функция ПроверкаПоВидуКонтроля(ВидКонтроля) Экспорт
	
	Для Каждого Проверка Из КонтрольУХПовтИсп.ВсеПроверки() Цикл
		ОбъектПроверка = Проверка.Создать();
		
		Если ОбъектПроверка.ВидКонтроля = ВидКонтроля Тогда
			Возврат ОбъектПроверка;
		КонецЕсли;
		
		ОбъектПроверка = неопределено;
		
	КонецЦикла;
	
	Возврат неопределено;
	
КонецФункции  

// Возвращает режим контроля для выбранного вида контроля. Для бюджетных лимитов/резервов возвращается пустая ссылка
Функция РежимКонтроля(ВидКонтроля) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидКонтроля)
		ИЛИ ВидКонтроля = ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхЛимитов 
		ИЛИ ВидКонтроля = ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольБюджетныхРезервов Тогда
		Возврат Перечисления.РежимыКонтроляДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКонтроля, "РежимКонтроля");
	
КонецФункции

// Возвращает признак блокирования проведения документа при наружении вида контроля документа
Функция БлокироватьПроведение(ВидКонтроля) Экспорт
	Возврат РежимКонтроля(ВидКонтроля) = Перечисления.РежимыКонтроляДокументов.Блокировать;
КонецФункции

#Область Ключи

// Функция - Все ключи
// 
// Возвращаемое значение:
//  Соответствие - в котором в ключе объект метаданных Справочник ключа, а в значении объект метаданных РегистрСведений
//
Функция ВсеКлючи() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить(Метаданные.Справочники.ОбъектыПланирования, неопределено);
	Результат.Вставить(Метаданные.Справочники.КлючиАналитикПланирования, Метаданные.РегистрыСведений.АналитикаПланирования);
	Результат.Вставить(Метаданные.Справочники.КлючиАналитикиПланированияРасчетовСКонтрагентами, Метаданные.РегистрыСведений.АналитикаПланированияРасчетовСКонтрагентами);
	Результат.Вставить(Метаданные.Справочники.КлючиАналитикиПланированияНоменклатуры, Метаданные.РегистрыСведений.АналитикаПланированияНоменклатуры);
	Результат.Вставить(Метаданные.Справочники.КлючиАналитикиПланированияПоставки, Метаданные.РегистрыСведений.АналитикаПланированияПоставки);
	Результат.Вставить(Метаданные.Справочники.КлючиАналитикиПланированияПотребностей, Метаданные.РегистрыСведений.АналитикаПланированияПотребностей);
	Результат.Вставить(Метаданные.Справочники.КлючиАналитикиПланированияСтатейБюджетов, Метаданные.РегистрыСведений.АналитикаПланированияСтатейБюджетов);
	Результат.Вставить(Метаданные.Справочники.КлючиАналитикиПланированияСтруктуры, Метаданные.РегистрыСведений.АналитикаПланированияСтруктуры);
	Результат.Вставить(Метаданные.Справочники.КлючиКонтроляБюджетныхЛимитовРезервов, Метаданные.РегистрыСведений.АналитикаКонтроляБюджетныхЛимитовРезервов);
	Результат.Вставить(Метаданные.Справочники.КлючиКонтроляЗадолженностиПоКонтрагенту, Метаданные.РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту);
	Результат.Вставить(Метаданные.Справочники.КлючиКонтроляОбъемаЗакупок, Метаданные.РегистрыСведений.АналитикаКонтроляОбъемаЗакупок);
	Результат.Вставить(Метаданные.Справочники.КлючиКонтроляПоДоговорам, Метаданные.РегистрыСведений.АналитикаКонтроляПоДоговорам);
	
	КонтрольУХВстраивание.ВсеКлючи(Результат);
	
	Возврат Результат;
	
КонецФункции

// Функция - Измерения ключей, для которых не производится синхронизация пометки удаления
// 
// Возвращаемое значение:
//  Массив - Измерения ключей, для которых не производится синхронизация пометки удаления
//
Функция ИзмеренияКлючейИсключения() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Справочник.КлючиАналитикиПланированияСтатейБюджетов.Реквизит.Аналитика1");
	Результат.Добавить("Справочник.КлючиАналитикиПланированияСтатейБюджетов.Реквизит.Аналитика2");
	Результат.Добавить("Справочник.КлючиАналитикиПланированияСтатейБюджетов.Реквизит.Аналитика3");
	Результат.Добавить("Справочник.КлючиАналитикиПланированияСтатейБюджетов.Реквизит.Аналитика4");
	Результат.Добавить("Справочник.КлючиАналитикиПланированияСтатейБюджетов.Реквизит.Аналитика5");
	Результат.Добавить("Справочник.КлючиАналитикиПланированияСтатейБюджетов.Реквизит.Аналитика6");
	Результат.Добавить("Справочник.ОбъектыПланирования.Реквизит.ТипСсылки");
	
	КонтрольУХВстраивание.ИзмеренияКлючейИсключения(Результат);
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает соответствие, в котором ключ - это тип, а в значении Структура с именем справочника ключа и именем
// реквизита.
Функция ИзмеренияКлючей() Экспорт
	
	ВсеКлючи = КонтрольУХПовтИсп.ВсеКлючи();
	ИзмеренияКлючейИсключения = КонтрольУХПовтИсп.ИзмеренияКлючейИсключения();
	
	Результат = Новый Соответствие;
	Для Каждого КлючЗначение Из ВсеКлючи Цикл
		
		КлючСправочник = КлючЗначение.Ключ;
		
		Для Каждого Реквизит Из КлючСправочник.Реквизиты Цикл
			
			Для Каждого Тип Из Реквизит.Тип.Типы() Цикл
				
				Если Тип = Тип("Число") ИЛИ Тип = Тип("Дата") ИЛИ Тип = Тип("Строка") ИЛИ Тип = Тип("Булево") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ИзмеренияКлючейИсключения.Найти(Реквизит.ПолноеИмя()) <> неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Ссылка = Новый (Тип);
				Если Метаданные.Перечисления.Содержит(Ссылка.Метаданные()) Тогда
					Продолжить;
				КонецЕсли;
				
				ИспользованиеТипа = Результат[Тип];
				Если ИспользованиеТипа = неопределено Тогда
					ИспользованиеТипа = Новый Массив;
					Результат.Вставить(Тип, ИспользованиеТипа);
				КонецЕсли;
				ИспользованиеТипа.Добавить(Новый Структура("Справочник, Реквизит", КлючСправочник.Имя, Реквизит.Имя));
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
